"""
2. **Обработка заказов**
   - Настрой загрузку данных и обновление остатка товаров на складе.
   - Если заказ превышает количество товара на складе, система должна 
   либо частично исполнить заказ, либо отклонить его с логированием 
   (подход выбери самостоятельно).
"""

def 


"""
6. **Генерация отчёта** — **`Участник 1`**
   - Сформируй отчёт для менеджера:
     - общее количество товаров на складе,
     - товары с критическими запасами,
     - рекомендации по закупкам.
   - Отчёт должен быть сохранен в формате `.txt` и автоматически обновляться ежедневно.
"""